You need to select individual data or slices of a DataFrame
Use loc or iloc to select one or more rows or values

In [2]:
import pandas as pd
# Create URL
url = 'https://raw.githubusercontent.com/chrisalbon/sim_data/master/titanic.csv'
# Load data
dataframe = pd.read_csv(url)

In [3]:
# Slect the first row
dataframe.iloc[0]

Name        Allen, Miss Elisabeth Walton
PClass                               1st
Age                                 29.0
Sex                               female
Survived                               1
SexCode                                1
Name: 0, dtype: object

In [4]:
dataframe.iloc[1:4]

,Name,PClass,Age,Sex,Survived,SexCode
1,"Allison, Miss Helen Loraine",1st,2.0,female,0,1
2,"Allison, Mr Hudson Joshua Creighton",1st,30.0,male,0,0
3,"Allison, Mrs Hudson JC (Bessie Waldo Daniels)",1st,25.0,female,0,1

In [5]:
dataframe.iloc[0:1]

                           Name PClass   Age     Sex  Survived  SexCode
0  Allen, Miss Elisabeth Walton    1st  29.0  female         1        1

DataFrames do not need to be numerically indexed. We can set the index of a
DataFrame to any value where the value is unique to each row. For example, we
can set the index to be passenger names and then select rows using a name

In [7]:
dataframe=dataframe.set_index(dataframe['Name'])
dataframe.loc['Allen, Miss Elisabeth Walton']

Name        Allen, Miss Elisabeth Walton
PClass                               1st
Age                                 29.0
Sex                               female
Survived                               1
SexCode                                1
Name: Allen, Miss Elisabeth Walton, dtype: object

In [8]:
dataframe.iloc[0:1]

,Name,PClass,Age,Sex,Survived,SexCode
Name,,,,,,
"Allen, Miss Elisabeth Walton","Allen, Miss Elisabeth Walton",1st,29.0,female,1,1

All rows in a pandas DataFrame have a unique index value. By default, this
index is an integer indicating the row position in the DataFrame; however, it
does not have to be. DataFrame indexes can be set to be unique alphanumeric
strings or customer numbers. To select individual rows and slices of rows,
pandas provides two methods:
loc is useful when the index of the DataFrame is a label (e.g., a string).
iloc works by looking for the position in the DataFrame. For example,
iloc[0] will return the first row regardless of whether the index is an integer
or a label.
It is useful to be comfortable with both loc and iloc since they will come up a
lot during data cleaning.